Revit 2026 API

# IFCExportOptionsAddOption Method

---

Adds a new named option to the options structure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddOption(
	string name,
	string value
)
```
```vb
Public Sub AddOption (
	name As String,
	value As String
)
```
```cpp
public:
void AddOption(
	String^ name,
	String^ value
)
```
```fsharp
member AddOption :
        name : string *
        value : string -> unit
```

#### Parameters

name String
     The option name.
value String
     The option value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Named options can be used to set options not accessible through the standard IFC export user interface. It is up to the implementation of the IExporterIFC interface to customize export behavior based on these options.

#### Reference

IFCExportOptions Class

Autodesk.Revit.DB Namespace